In [1]:
# # 문제 06 유형(DataSet_06.csv 이용)
#
# 구분자 : comma(“,”), 4,323 Rows, 19 Columns, UTF-8 인코딩

# 주택 관련 정보를 바탕으로 주택 가격을 예측해 보고자 한다. 
# 다음은 확보한 주택 관련 데이터로 총 19개 컬럼으로 구성되어
# 있다.

# 컬 럼 / 정 의 / Type
# id / 매물 번호 / Double
# date / 날짜 / String
# price / 거래 가격 / Double
# bedrooms / 방 개수 / Double
# bathrooms / 화장실 개수 (화장실은 있으나 샤워기 없는 경우 0.5로 처리) / Double
# sqft_living / 건축물 면적 / Double
# sqft_lot / 대지 면적 / Double
# floors / 건축물의 층수 / Double
# waterfront / 강변 조망 가능 여부 (0 / 1) / Double
# view / 경관 (나쁨에서 좋음으로 0 ~ 4로 표시) / Double
# condition / 관리 상태 (나쁨에서 좋음으로 1 ~ 5로 표시) / Double
# grade / 등급 (낮음에서 높음으로 1 ~ 13으로 표시) / Double
# sqft_above / 지상 면적 / Double
# sqft_basement / 지하실 면적 / Double
# yr_built / 건축 연도 / Double
# yr_renovated / 개축 연도 / Double
# zipcode / 우편번호 / Double
# sqft_living15 / 15개의 인근 주택의 평균 건물 면적 / Double
# sqft_lot15 / 15개의 인근 주택의 평균 대지 면적 / Double

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('../Dataset/Dataset_06.csv')
df.head(3)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,sqft_living15,sqft_lot15
0,2597000006,20150309T000000,347500.0,3,1.50,1180,8353,1.0,0,0,3,7,1180,0,1960,0,98155,1710,8748
1,8813400345,20150414T000000,575000.0,2,1.00,980,3663,1.0,0,0,5,7,980,0,1909,0,98105,1620,3706
2,226059106,20150102T000000,489500.0,3,1.75,2090,65558,1.0,0,0,3,8,1330,760,1977,0,98072,2450,47178

In [5]:
# 1.강변 조망이 가능한지 여부(waterfront)에 따라 평균 주택 가격을 계산하고 조망이
# 가능한 경우와 그렇지 않은 경우의 평균 가격 차이의 절대값을 구하시오. 답은
# 소수점 이하는 버리고 정수부만 기술하시오. (답안 예시) 1234567

In [6]:
df1 = df.copy()

In [7]:
water_df = df1[df1['waterfront'] == 1]
land_df = df1[df1['waterfront'] == 0]

In [8]:
water_df['price'].mean()

1699437.878787879

In [9]:
land_df['price'].mean()

532165.1307692308

In [10]:
abs(water_df['price'].mean() - land_df['price'].mean())

1167272.748018648

In [11]:
# 답 : 1167272

In [12]:
# 2.price, bedrooms, bathrooms, sqft_living, sqft_lot, floors, yr_built 등 7개의 변수 간의
# 상관분석을 수행하고 price와의 상관계수의 절대값이 가장 큰 변수와 가장 작은
# 변수를 차례로 기술하시오. (답안 예시) view, zipcode

In [13]:
df2 = df.copy()

In [15]:
df2.columns.to_list()

['id',
 'date',
 'price',
 'bedrooms',
 'bathrooms',
 'sqft_living',
 'sqft_lot',
 'floors',
 'waterfront',
 'view',
 'condition',
 'grade',
 'sqft_above',
 'sqft_basement',
 'yr_built',
 'yr_renovated',
 'zipcode',
 'sqft_living15',
 'sqft_lot15']

In [16]:
var_list = ['price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors','yr_built']

In [17]:
result = df2[var_list].corr().drop('price')['price'].abs()
result

bedrooms       0.279824
bathrooms      0.534277
sqft_living    0.709157
sqft_lot       0.106341
floors         0.270423
yr_built       0.059895
Name: price, dtype: float64

In [18]:
result.idxmax()

'sqft_living'

In [19]:
result.idxmin()

'yr_built'

In [20]:
# 답 : sqft_living, yr_built

In [21]:
# 3. id, date, 그리고 zipcode를 제외한 모든 변수를 독립변수로, price를 종속변수로 하여
# 회귀분석을 수행하시오. 통계적 유의성을 갖지 못하는 독립변수를 제거하면 회귀
# 모형에 남는 변수는 모두
# 몇 개인가? 이 때 음의 회귀계수를 가지는 변수는 몇 개인가? (답안 예시) 5, 3
# =============================================================================

# =============================================================================
# (참고)
# import pandas as pd
# import numpy as np
# from sklearn.linear_model import LinearRegression
# from statsmodels.formula.api import ols

In [22]:
df3 = df.copy()

In [26]:
var_list = df3.columns.drop(['id', 'date', 'zipcode', 'price'])

In [27]:
var_list

Index(['bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors',
       'waterfront', 'view', 'condition', 'grade', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'sqft_living15',
       'sqft_lot15'],
      dtype='object')

In [29]:
from statsmodels.formula.api import ols

In [30]:
form = 'price~' + '+'.join(var_list)

In [31]:
model = ols(form, data=df3)

In [32]:
result = model.fit()

In [44]:
result2 = result.pvalues.drop('Intercept').reset_index()
result2

            index              0
0        bedrooms   1.262643e-11
1       bathrooms   5.681393e-13
2     sqft_living   2.616953e-71
3        sqft_lot   9.532159e-01
4          floors   4.266372e-06
5      waterfront   1.931929e-56
6            view   5.028272e-17
7       condition   3.157318e-03
8           grade  1.760208e-156
9      sqft_above   1.431345e-11
10  sqft_basement   2.030015e-23
11       yr_built  1.717539e-122
12   yr_renovated   3.226128e-02
13  sqft_living15   2.352216e-03
14     sqft_lot15   1.017748e-01

In [50]:
temp = result2[result2[0] >= 0.05]
temp

         index         0
3     sqft_lot  0.953216
14  sqft_lot15  0.101775

In [57]:
index_list = result2[~result2['index'].isin(temp['index'])]
index_list

            index              0
0        bedrooms   1.262643e-11
1       bathrooms   5.681393e-13
2     sqft_living   2.616953e-71
4          floors   4.266372e-06
5      waterfront   1.931929e-56
6            view   5.028272e-17
7       condition   3.157318e-03
8           grade  1.760208e-156
9      sqft_above   1.431345e-11
10  sqft_basement   2.030015e-23
11       yr_built  1.717539e-122
12   yr_renovated   3.226128e-02
13  sqft_living15   2.352216e-03

In [58]:
len(index_list)

13

In [61]:
result3 = result.params.reset_index()
result3

            index             0
0       Intercept  6.302495e+06
1        bedrooms -2.499553e+04
2       bathrooms  5.179234e+04
3     sqft_living  9.230805e+01
4        sqft_lot  5.444844e-03
5          floors  3.748199e+04
6      waterfront  6.276528e+05
7            view  4.039778e+04
8       condition  1.570573e+04
9           grade  1.306274e+05
10     sqft_above  3.373579e+01
11  sqft_basement  5.857225e+01
12       yr_built -3.666896e+03
13   yr_renovated  1.770319e+01
14  sqft_living15  2.301144e+01
15     sqft_lot15 -2.322904e-01

In [62]:
result3 = result3[result3['index'].isin(index_list['index'])]
result3

            index              0
1        bedrooms  -24995.525070
2       bathrooms   51792.344459
3     sqft_living      92.308047
5          floors   37481.990454
6      waterfront  627652.843940
7            view   40397.783242
8       condition   15705.734137
9           grade  130627.395937
10     sqft_above      33.735791
11  sqft_basement      58.572248
12       yr_built   -3666.895673
13   yr_renovated      17.703192
14  sqft_living15      23.011443

In [64]:
result3[result3[0]<0]

       index             0
1   bedrooms -24995.525070
12  yr_built  -3666.895673

In [66]:
# 답 : 13, 2

In [67]:
# # 문제 07 유형(DataSet_07.csv 이용)
#
# 구분자 : comma(“,”), 400 Rows, 9 Columns, UTF-8 인코딩
#
# 대학원 진학을 위하여 어떤 항목이 중요하게 영향을 미치는지
# 아래 데이터로 분석하고자 한다.

# 컬 럼 / 정 의 / Type
# Serial_No / 구분자 번호 / Double
# GRE / GRE 시험 성적 / Double
# TOEFL / TOEFL 시험 성적 / Double
# University_Rating / 대학 평가 그룹 (1 ~ 5) / Double
# SOP / 자기 소개서 점수 (1 ~ 5) / Double
# LOR / 추천서 점수 (1 ~ 5) / Double
# CGPA / 학부 평량 평점 (10점 만점 환산 점수) / Double
# Research / 연구 참여 경험 여부 (0 / 1) / Double
# Chance_of_Admit / 합격 가능성 / Double
# =============================================================================
# =============================================================================

# =============================================================================
# (참고)
# #1
# import pandas as pd
# #2
# import scipy.stats as stats
# #3
# from sklearn.linear_model import LogisticRegression
# Solver = ‘liblinear’, random_state = 12

In [68]:
df = pd.read_csv('../Dataset/Dataset_07.csv')
df.head(3)

,Serial_No,GRE,TOEFL,University_Rating,SOP,LOR,CGPA,Research,Chance_of_Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72

In [69]:
# 1. 합격 가능성에 GRE, TOEFL, CGPA 점수 가운데 가장 영향이 큰 것이 어떤 점수인지
# 알아 보기 위해서 상관 분석을 수행한다.
# - 피어슨(Pearson) 상관계수 값을 구한다.
# - Chance_of_Admit와의 가장 큰 상관계수 값을 가지는 항목의 상관계수를 소수점 넷째
# 자리에서 반올림하여 셋째 자리까지 기술하시오. (답안 예시) 0.123

In [71]:
var_list = ['GRE', 'TOEFL', 'CGPA', 'Chance_of_Admit']

In [72]:
df1 = df.copy()

In [76]:
result = df1[var_list].corr().drop('Chance_of_Admit')['Chance_of_Admit'].abs().max()
result

0.8732890993553006

In [77]:
round(result, 3)

0.873

In [78]:
# 답 : 0.873

In [79]:
# 2.GRE 점수의 평균 이상을 받은 그룹과 평균 미만을 받은 그룹의 CGPA 평균은 차이가
# 있는지
# 검정을 하고자 한다.
# - 적절한 검정 방법을 선택하고 양측 검정을 수행하시오 (등분산으로 가정)
# - 검정 결과, 검정통계량의 추정치를 소수점 셋째 자리에서 반올림하여 소수점 두 자리까지
# 기술하시오.
# (답안 예시) 1.23

In [80]:
df2 = df.copy()

In [81]:
up = df2[df2['GRE'] >= df2['GRE'].mean()]['CGPA']
down = df2[df2['GRE'] < df2['GRE'].mean()]['CGPA']

In [82]:
from scipy.stats import ttest_ind

In [83]:
result = ttest_ind(up, down)
result

Ttest_indResult(statistic=19.443291692470982, pvalue=1.1127037052806161e-59)

In [84]:
# 답 : 19.44

In [85]:
# 3.Chance_of_Admit 확률이 0.5를 초과하면 합격으로, 이하이면 불합격으로 구분하고
# 로지스틱 회귀분석을 수행하시오.
# - 원데이터만 사용하고, 원데이터 가운데 Serial_No와 Label은 모형에서 제외
# - 각 설정값은 다음과 같이 지정하고, 언급되지 않은 사항은 기본 설정값을 사용하시오
# Seed : 123
# - 로지스틱 회귀분석 수행 결과에서 로지스틱 회귀계수의 절대값이 가장 큰 변수와 그 값을
# 기술하시오. 
# (로지스틱 회귀계수는 반올림하여 소수점 둘째 자리까지 / Intercept는 제외)
# (답안 예시) abc, 0.12

In [86]:
df3 = df.copy()

In [87]:
df.columns.to_list()

['Serial_No',
 'GRE',
 'TOEFL',
 'University_Rating',
 'SOP',
 'LOR',
 'CGPA',
 'Research',
 'Chance_of_Admit']

In [91]:
df3.head(3)

,Serial_No,GRE,TOEFL,University_Rating,SOP,LOR,CGPA,Research,Chance_of_Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72

In [92]:
df3['ch_ratio'] = np.where(df3['Chance_of_Admit'] > 0.5, 1, 0)

In [93]:
var_list = ['GRE', 'TOEFL', 'University_Rating', 'SOP', 'LOR',
 'CGPA', 'Research']

In [94]:
from sklearn.linear_model import LogisticRegression

In [111]:
model = LogisticRegression(random_state=123, fit_intercept=False)

In [112]:
result = model.fit(df3[var_list], df3['ch_ratio'])
result

C:\Users\BAUM\AppData\Roaming\Python\Python39\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression(fit_intercept=False, random_state=123)

In [113]:
result.coef_

array([[-0.08997848,  0.10633284,  0.05630754, -0.24553173,  1.01520232,
         2.01033216,  0.68856869]])

In [114]:
final = pd.Series(result.coef_.reshape(-1))
final

0   -0.089978
1    0.106333
2    0.056308
3   -0.245532
4    1.015202
5    2.010332
6    0.688569
dtype: float64

In [115]:
final.index = var_list

In [116]:
final

GRE                 -0.089978
TOEFL                0.106333
University_Rating    0.056308
SOP                 -0.245532
LOR                  1.015202
CGPA                 2.010332
Research             0.688569
dtype: float64

In [117]:
final.abs().idxmax()

'CGPA'

In [118]:
# 답 : CGPA, 2.01